# SetLineWeightChoice

## Description
Set the current choice of the line weight dialog control to the value specified in mils.

```pascal
PROCEDURE SetLineWeightChoice(
				dialogID   : LONGINT;
				itemID     : LONGINT;
				lineWeight : INTEGER);
```

```python
def vs.SetLineWeightChoice(dialogID, itemID, lineWeight):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT|   |
|itemID|LONGINT|   |
|lineWeight|INTEGER|   |

## Version
Availability: from VectorWorks12.0

## Category
* Dialogs - Modern